b5463/kino-d4/firmware/uvc-preview/sdkconfig.defaults
# XIAO ESP32-S3 Sense: ESP32-S3, 8 MB QIO flash, 8 MB octal PSRAM.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# TinyUSB owns the one USB PHY while this app is running, so the console
# CANNOT be USB-Serial-JTAG: the port is a webcam, not a serial device.
# Logs go to UART0 on GPIO43/44 instead, where a USB-serial adapter can read
# them. This is also why reflashing needs the BOOT button (README).
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Two clean builds of one commit must produce the same .bin, so a hash in a
# bench record identifies the source. See firmware/p4/sdkconfig.defaults for
# the measurement.
CONFIG_APP_REPRODUCIBLE_BUILD=y

# --- UVC device ---
# Named so four boards on one hub are told apart in the host's camera list.
CONFIG_TUSB_MANUFACTURER="KINO"
CONFIG_TUSB_PRODUCT="KINO D4 camera preview"

# MJPEG straight from the sensor: the OV3660 already produces JPEG, so nothing
# on the S3 re-encodes anything.
CONFIG_FORMAT_MJPEG_CAM1=y

# Bulk, on a second attempt with the buffer budget actually worked out.
#
# The first attempt would not boot: the fault LED reported a failed camera
# init or UVC buffer allocation, and the transfer buffer was 160 KB of
# internal RAM on a guess. Console mode then measured real JPEGs at
# 7.7-30.4 KB, so that buffer is now 96 KB and 64 KB of internal RAM has gone
# back to the USB stack.
#
# It did not lift the frame rate: 6.1 fps against isochronous's 6.0. So the
# transfer mode is not the bottleneck either, and neither is the sensor —
# console mode sustains at least 16 fps, capturing 15 frames per 920 ms
# against a 60 ms-per-frame loop delay. Both obvious levers are now tested
# and 6 fps is what this component delivers on this part. That is enough to
# judge focus, colour and framing, which is the job; chasing it further means
# profiling inside the UVC component, which this tool does not justify.
#
# Bulk is kept even so, and this is a judgement rather than a measurement:
# frame rate and artifact count came out equal, and bulk transfers retry lost
# packets where isochronous cannot. Our one remaining defect class is corrupt
# frame data, so the mode with retransmission is the better default even
# though nothing measured says so today.
CONFIG_UVC_MODE_BULK_CAM1=y

# VGA at 15 fps, not the component's 720p default. The S3's USB is full speed
# (12 Mbit/s), and a starved 720p stream stutters in a way that looks like a
# bad module. VGA is more than enough to judge focus, cast and framing, and
# CONFIG_UVC_CAM1_MULTI_FRAMESIZE leaves the larger sizes in the descriptor
# for a host that wants to ask.
CONFIG_FRAMESIZE_VGA=y
CONFIG_UVC_CAM1_FRAMERATE=15
CONFIG_UVC_CAM1_MULTI_FRAMESIZE=y
